robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2FOC-V3_6/src/2FOC.c
volatile int  IKp = 0; //8;
volatile int  IKi = 0; //2;
volatile char IKs = 0; //10;
volatile long IIntLimit = 0;

volatile int  SKp = 0x0C;
volatile int  SKi = 0x10;
volatile char SKs = 0x0A;
volatile long SIntLimit = 0;

/////////////////////////////////////////

void setMaxCurrent(int nom, int peak, int ovr)
{
    Inom = nom;
    Ipeak = peak;
    I2nom = (long)nom*(long)nom;
    I2Tlimit = ((long)peak*(long)peak - I2nom) * 10;
    Iovr = ovr;
}

void setIPid(int kp, int ki, char shift)
{
    IKp = kp;
    IKi = ki/2;
    IKs = shift;
    IIntLimit = ((long)PWM_MAX)<<shift;
    //IIntLimit = ((long)PWM_MAX/2)<<shift; // TEST
}

void setSPid(int kp, int ki, char shift)
{
    SKp = kp;
    SKi = ki/2;
    SKs = shift;
    SIntLimit = ((long)PWM_MAX)<<shift;
    //SIntLimit = ((long)PWM_MAX/2)<<shift; // TEST
}

void ZeroControlReferences()
{
    CtrlReferences.VqRef = 0;
    CtrlReferences.IqRef = 0;
    CtrlReferences.WRef = 0;

    VdA = 0;
    VqA = 0;
    VqL = 0;
    VqRef = 0;
    IqRef = 0;
    speed_error_old = 0;
    Is = 0;
    iQerror_old = 0;
    iDerror_old = 0;
    limit = 0;
}

void RequestControlMode(char cm)
{
    //if (cm == gControlMode) return;

    ZeroControlReferences();

    ++gCtrlModeReqCnt;
    gCtrlModeReq = cm;
}

void ResetSetpointWatchdog()
{
    WriteTimer5(0);
    IFS1bits.T5IF = 0;
}

//extern volatile int position_fbk;

BOOL updateOdometry()
{
    if (MotorConfig.has_qe || MotorConfig.has_speed_qe)
    {
        static const int UNDERSAMPLING = PWMFREQUENCY / 1000;
        static int speed_undersampler = 0;

        if (!QEready()) return FALSE;
        
        static int position_old = 0;
        int position = QEgetPosition();
        int delta = position - position_old;
        position_old = position;
        
        //position_fbk = position;

        gQEPosition += delta;

        if (++speed_undersampler == UNDERSAMPLING) // we obtain ticks per ms
        {
            speed_undersampler = 0;

            static long QEPosition_old = 0;

            gQEVelocity = (gQEVelocity + gQEPosition - QEPosition_old) / 2;

            QEPosition_old = gQEPosition;

            return TRUE;
        }

        return FALSE;
    }
    else if (MotorConfig.has_hall)
    {
        gQEPosition = DHESPosition();
        gQEVelocity = DHESVelocity();

        return FALSE;
    }

    return FALSE;
}

int alignRotorIndex(volatile int* IqRef)
{
    if (MotorConfig.has_hall) return 0;
    
    if (!sAlignInProgress) return 0;

    static int encoder_fake = 0;
    
    static int IqRef_fake = 0;
    
    const int ENCODER_1_5_REV = (3*QE_ELETTR_DEG_PER_REV())/2;

    static int deltaA =  60;
    static int deltaB = -60;
    
    if (sAlignInProgress < 3)
    {       
        if (QEready())
        {
            sAlignInProgress = gEncoderConfig.full_calibration ? 3 : 0;
            gEncoderError.uncalibrated = 0;
            QEcountErrorClear();
        }
        
        if (sAlignInProgress == 1)
        {
            static unsigned int timer = 0;
        
            if (IqRef_fake < Inom/2)
            {
                ++IqRef_fake;
            }
            else if (encoder_fake < ENCODER_1_5_REV)
            {
                if (++timer > 200) { timer = 0; ++encoder_fake; }
            }
            else
            {
                //deltaA = -120;
                //deltaB = 0;
                sAlignInProgress = 2;
            }
        }
    
        if (sAlignInProgress == 2)
        {
            static unsigned int timer = 0;
        
            if (encoder_fake > -ENCODER_1_5_REV)
            {
                if (++timer > 200) { timer = 0; --encoder_fake; }
            }
            else
            {
                // Index is broken
                *IqRef = IqRef_fake = 0;
                QE_RISE_ERROR(index_broken);
                sAlignInProgress = 0;
            }
        }
    }
    
    ////////////////////////////////////
    
    static int rotorA;
    static int rotorB;
    
    static int encoder_fake_0 = 0;
    
    static unsigned long timer = 0;
    
    if (sAlignInProgress == 3)
    {           
        if (IqRef_fake < Inom)
        {
            ++IqRef_fake;
        }
        else if (++timer > 20000)
        {
            encoder_fake_0 = encoder_fake;
            timer = 0;
            sAlignInProgress = 4;
        }
    }
 
    if (sAlignInProgress == 4)
    {
        encoder_fake = encoder_fake_0 + deltaA;
        
        if (++timer > 60000UL)
        {
            rotorA = QEgetElettrDeg();
            timer = 0;
            sAlignInProgress = 5;
        }
    }
    
    if (sAlignInProgress == 5)
    {
        encoder_fake = encoder_fake_0 + deltaB;
        
        if (++timer > 120000UL)
        {
            rotorB = QEgetElettrDeg();
            
            int delta = rotorB - rotorA;
            
            while (delta >= 180) delta -= 360;
            while (delta < -180) delta += 360;
            
            if (abs(delta) > 90)
            {
                int angle = rotorA + delta/2;
            
                while (angle >= 360) angle -= 360;
                while (angle <    0) angle += 360;
            
                gEncoderConfig.offset = encoder_fake_0 + (deltaA + deltaB)/2 + 90 - angle;
                
                while (gEncoderConfig.offset >= 360) gEncoderConfig.offset -= 360;
                while (gEncoderConfig.offset <    0) gEncoderConfig.offset += 360;
                
                IqRef_fake = 0;
                sAlignInProgress = 0;
            }
            else
            {
                if (deltaB)
                {
                    deltaB = 0;
                    deltaA = -120;
                    timer = 0;
                    sAlignInProgress = 4;
                }
                else
                {
                    // Index is broken
                    IqRef_fake = 0;
                    sAlignInProgress = 0;
                    gEncoderError.uncalibrated = 0;
                    QE_RISE_ERROR(autocalib_error);
                }
            }
        }
    }
    
